In [1]:
# importing pandas library
import pandas as pd

# creating and initializing a list
values= [['Usha',500],['Nikhitha',450],['Ria',300],['Rahath',400]]

# creating a pandas dataframe
df = pd.DataFrame(values,columns=['Name','Total_Marks'])

# Applying lambda function to find
# percentage of 'Total_Marks' column
# using df.assign()
df = df.assign(Percentage = lambda x: (x['Total_Marks'] /500 * 100))

# displaying the data frame
print(df)

       Name  Total_Marks  Percentage
0      Usha          500       100.0
1  Nikhitha          450        90.0
2       Ria          300        60.0
3    Rahath          400        80.0

In [9]:

import pandas as pd
values_list = [[2, 1.2, 20], [4, 3.4, 56], [20, 4.6, 7],[12, 3.8, 9],[4, 5.6, 78]]
df = pd.DataFrame(values_list, columns=['field1', 'field2', 'field3'])
df = df.assign(Product=lambda x: (x['field1'] * x['field2'] * x['field3']))
print(df)

   field1  field2  field3  Product
0       2     1.2      20     48.0
1       4     3.4      56    761.6
2      20     4.6       7    644.0
3      12     3.8       9    410.4
4       4     5.6      78   1747.2

In [10]:
import pandas as pd
import numpy as np

values_list = [[2, 1.2, 20], [4, 3.4, 56], [20, 4.6, 7],[12, 3.8, 9],[4, 5.6, 78]]
df = pd.DataFrame(values_list, columns=['field1', 'field2', 'field3'],
				index=['a', 'b', 'c', 'd', 'e'])
df = df.apply(lambda x: np.square(x) if x.name == 'd' else x, axis=1)
print(df)

   field1  field2  field3
a     2.0    1.20    20.0
b     4.0    3.40    56.0
c    20.0    4.60     7.0
d   144.0   14.44    81.0
e     4.0    5.60    78.0

In [12]:
import pandas as pd
import numpy as np

values_list = [[2, 1.2, 20], [4, 3.4, 56], [20, 4.6, 7],[12, 3.8, 9],[4, 5.6, 78]]
df = pd.DataFrame(values_list, columns=['field1', 'field2', 'field3'],
				index=['a', 'b', 'c', 'd', 'e'])
df = df.apply(lambda x: np.square(x) if x.name in [
			'a', 'c'] else x, axis=1)
df

   field1  field2  field3
a     4.0    1.44   400.0
b     4.0    3.40    56.0
c   400.0   21.16    49.0
d    12.0    3.80     9.0
e     4.0    5.60    78.0

In [13]:
import pandas as pd
import numpy as np

values_list = [[2, 1.2, 20], [4, 3.4, 56], [20, 4.6, 7],[12, 3.8, 9],[4, 5.6, 78]]
df = pd.DataFrame(values_list, columns=['field1', 'field2', 'field3'],
				index=['a', 'b', 'c', 'd', 'e'])
df = df.apply(lambda x: np.square(x) if x.name in ['b', 'f'] else x, axis=1)
df = df.assign(Product=lambda x: (x['field1'] * x['field2'] * x['field3']))
df

   field1  field2  field3    Product
a     2.0    1.20    20.0      48.00
b    16.0   11.56  3136.0  580034.56
c    20.0    4.60     7.0     644.00
d    12.0    3.80     9.0     410.40
e     4.0    5.60    78.0    1747.20